[
  {
    "id": "5d851af7-029a-470d-b0f7-c166b1ecc7d5",
    "name": "Potion of Healing",
    "desc": "A small vial filled with red liquid that glimmers when agitated. Drinking this potion restores a small amount of vitality.",
    "rarity": "Common",
    "cost": "50 gp (varies by market)",
    "category": "Potion (Consumable)",
    "weight": "½ lb",
    "properties": {
      "Effect": "You regain 2d4 + 2 hit points when you drink this potion.",
      "Use": "Action to drink (or administer to another)"
    }
  },
  {
    "id": "2c3c8a8c-abfc-4757-836a-ab8787f4233f",
    "name": "Bag of Holding",
    "desc": "This appears as an ordinary cloth sack, but it is enchanted to hold far more than its outside dimensions suggest.",
    "rarity": "Uncommon",
    "cost": "500 gp (DMG value, variable)",
    "category": "Wondrous Item",
    "weight": "",
    "properties": {
      "Capacity": "Inside is a pocket dimension holding up to 500 pounds (volume up to 64 cubic feet】. The bag always weighs 15 lb, regardless of contents.",
      "Special": "Retrieving an item from the bag requires an Action. If the bag is overloaded or punctured, it ruptures and is destroyed, ejecting its contents. If turned inside out, contents spill out but bag is fine. Placing a Bag of Holding into an extra-dimensional space (like another bag of holding) opens a rift to the Astral Plane."
    }
  },
  {
    "id": "769bf54c-df4a-4eb3-b35e-740b99f85c23",
    "name": "Boots of Elvenkind",
    "desc": "Soft leather boots that make no sound, often crafted in Elven style.",
    "rarity": "Uncommon",
    "cost": "Varies (typically 500 gp or more)",
    "category": "Wondrous Item",
    "weight": "",
    "properties": {
      "Attunement": "No",
      "Effect": "While wearing these boots, your steps make no sound, regardless of the surfac】. You also have advantage on Dexterity (Stealth) checks that rely on moving silently."
    }
  },
  {
    "id": "ee4d29fa-1ad8-4aad-80fb-17b4c5d33b29",
    "name": "Cloak of Protection",
    "desc": "A magical cloak that fortifies the wearer’s defenses. Often a fine cloak embroidered with protective sigils.",
    "rarity": "Uncommon",
    "cost": "Varies (~750 gp)",
    "category": "Wondrous Item",
    "weight": "",
    "properties": {
      "Attunement": "Yes",
      "Effect": "While wearing this cloak, you gain a +1 bonus to Armor Class **and** to all saving throw】."
    }
  },
  {
    "id": "72b6beb8-9f79-49d8-8dfb-78e73d0e427c",
    "name": "+1 Longsword",
    "desc": "A finely crafted longsword engraved with runes. It is magically enhanced to strike true.",
    "rarity": "Uncommon",
    "cost": "Varies (~500 gp)",
    "category": "Weapon (Martial Melee)",
    "weight": "3 lb",
    "properties": {
      "Attunement": "No",
      "Effect": "You have a +1 bonus to attack rolls and damage rolls made with this magic sword. It counts as magical for overcoming resistance and immunity."
    }
  },
  {
    "id": "8bcccbac-1fa4-4090-9d30-d0500cf93f0d",
    "name": "Wand of Fireballs",
    "desc": "A wooden wand carved with draconic flames. This wand allows the wielder to unleash explosive bursts of fire.",
    "rarity": "Rare",
    "cost": "Varies (~5,000 gp)",
    "category": "Wand",
    "weight": "",
    "properties": {
      "Attunement": "Yes (Spellcaster)",
      "Effect": "While attuned, you can expend 1 or more charges to cast the *Fireball* spell (Save DC 15) from the wand. For 1 charge, you cast a 3rd-level Fireball (8d6 fire damage). You may increase the spell level by spending an extra charge per spell level. If you expend the wand’s last charge, roll a d20; on a 1, the wand crumbles into ash.",
      "Charges": "7 (regains 1d6+1 charges daily at dawn)"
    }
  },
  {
    "id": "6877e838-5615-43ff-9f74-3dece88b1b43",
    "name": "Ring of Invisibility",
    "desc": "A plain gold ring that becomes invisible itself when worn. It grants the power of invisibility to its wearer.",
    "rarity": "Legendary",
    "cost": "Priceless (legendary item)",
    "category": "Ring",
    "weight": "—",
    "properties": {
      "Attunement": "Yes",
      "Effect": "While wearing this ring, you can use an action to turn invisible. There is no time limit – you remain invisible until the ring is removed or until you attack or cast a spell. Activating or deactivating the invisibility requires an action. (No charges; works at will.)"
    }
  },
  {
    "id": "ca5ae3ee-3db2-4842-841d-f941f7f0b180",
    "name": "Carpet of Flying",
    "desc": "A beautifully woven carpet that responds to its master’s commands and can carry passengers through the air.",
    "rarity": "Very Rare",
    "cost": "Varies (~25,000 gp for larger ones)",
    "category": "Wondrous Item",
    "weight": "varies (light for its size)",
    "properties": {
      "Attunement": "No",
      "Effect": "You can use an action to speak the carpet’s command word and make it hover and fly. It moves according to your spoken directions, up to its listed Fly speed, and can carry up to its listed capacity (double capacity at half speed).",
      "Sizes": "Carpets come in various sizes: 3x5 ft (200 lb cap, speed 80 ft), 4x6 ft (400 lb, 60 ft), 5x7 ft (600 lb, 40 ft), 6x9 ft (800 lb, 30 ft】."
    }
  },
  {
    "id": "ddd2665b-70c5-491c-b6bb-d5e9ca8636f5",
    "name": "Cube of Force",
    "desc": "A small magical cube with engraved runes on each face. When activated, it creates invisible force barriers.",
    "rarity": "Rare",
    "cost": "Approx. 8,000 gp",
    "category": "Wondrous Item",
    "weight": "1 lb",
    "properties": {
      "Attunement": "Yes",
      "Effect": "Each face of the cube corresponds to a different level of force field. As an action, you can press one face to expend 1 or more charges to cast a specific force effect (spells: Face 1 – *Mage Armor* (1 charge), Face 2 – *Shield* (1 charge), Face 3 – *Leomund’s Tiny Hut* (3 charges), Face 4 – *Private Sanctum* (4 charges), Face 5 – *Wall of Force* (5 charges), Face 6 – *Prismatic Wall* effect (all 6 faces together】). The chosen barrier surrounds you in a 15-foot cube. The effects can block certain types of physical or magical travel depending on which face is activated (e.g., one face might allow only breathable air through, another blocks living matter, etc.).",
      "Charges": "10 (regains 1d6 charges at dawn】"
    }
  },
  {
    "id": "0f04a8af-ab8b-41a1-8b1a-f88667b75291",
    "name": "Staff of the Woodlands",
    "desc": "A wooden staff decorated with holly and other natural motifs. It is warm to the touch and thrums with druidic power.",
    "rarity": "Very Rare",
    "cost": "— (highly valued among druids)",
    "category": "Staff",
    "weight": "4 lb",
    "properties": {
      "Attunement": "Yes (Druid only)",
      "Effect": "The staff can be used as a magical Quarterstaff (+2 attack and damage). It allows the attuned druid to cast certain spells by expending charges: *Animal Friendship* (1 charge), *Speak with Animals* (1 charge), *Speak with Plants* (2 charges), *Wall of Thorns* (6 charges), and more. It also has the unique ability that if you plant it in fertile earth and expend 1 charge, it transforms into a healthy tree (60-foot tall, 5-foot diameter trunk) which lasts for up to 1 day or until dismisse】.",
      "Charges": "10 (regains 1d6+4 charges at dawn)"
    }
  },
  {
    "id": "1795755c-07b9-4b2a-bb7a-25a43cb7962a",
    "name": "Vorpal Sword",
    "desc": "A razor-sharp magical sword of legendary potency. Its edge is so keen it can slice through nearly anything.",
    "rarity": "Legendary",
    "cost": "— (legendary artifact)",
    "category": "Weapon (Any Sword)",
    "weight": "3 lb",
    "properties": {
      "Attunement": "Yes",
      "Effect": "This is a +3 magical sword. In addition to the attack and damage bonus, when you attack a creature that has a head and roll a natural 20 on the attack (critical hit), you cut off the creature’s hea】. The creature dies if it cannot survive without its head. (Creatures immune to slashing damage, or with no head, are not slain by this effect.)"
    }
  },
  {
    "id": "2f822687-2f5a-441f-a488-5d7f30dbec3c",
    "name": "Bowl of Commanding Water Elementals",
    "desc": "A silver bowl etched with aquatic designs. When filled with water, it can summon an elemental from the Plane of Water.",
    "rarity": "Rare",
    "cost": "",
    "category": "Wondrous Item",
    "weight": "3 lb",
    "properties": {
      "Attunement": "Yes",
      "Effect": "If the bowl is filled with water, you can use an action to speak a command word and summon a Water Elemental as if you had cast the *Conjure Elemental* spel】. The elemental obeys your commands and remains for up to 1 hour (or until it dies or you dismiss it). The bowl can’t be used this way again until the next dawn."
    }
  },
  {
    "id": "fd874fae-b16f-44eb-a7ed-8ad1fd0f32ff",
    "name": "Chime of Opening",
    "desc": "A hollow metal tube about a foot long. When struck, it produces a clear tone that can magically unlock doors and chests.",
    "rarity": "Rare",
    "cost": "",
    "category": "Wondrous Item",
    "weight": "1 lb",
    "properties": {
      "Attunement": "No",
      "Effect": "As an action, you can strike the chime while pointing it at an object (door, lid, lock) that is closed or locked within 120 feet. The chime casts the *Knock* spell on that target, opening or unlocking it (if not barred by a more powerful magic】. Each use expends one 'charge.' After 10 uses, the chime cracks and becomes nonmagical.",
      "Charges": "10 uses"
    }
  },
  {
    "id": "e7570aa7-d014-44e3-b39a-3ebffe408896",
    "name": "Circlet of Blasting",
    "desc": "A metal circlet adorned with a ruby. It allows the wearer to unleash a burst of fire energy.",
    "rarity": "Uncommon",
    "cost": "",
    "category": "Wondrous Item",
    "weight": "—",
    "properties": {
      "Attunement": "No",
      "Effect": "While wearing this circlet, you can use an action to cast *Scorching Ray* (spell attack +5】. This property can’t be used again until the next dawn. (Scorching Ray produces three rays of fire, each dealing 2d6 fire damage on a hit.)"
    }
  }
]